**Importing Required Libraries**

Intruduction of Numpy in 'PyTorch for Deep Learning Bootcamp: Zero to Mastery' from Udemy

In [1]:
import pandas as pd

**Data Preparation**

In [4]:
# create list and ocnvert to dataformat
A = [[1, 2, 3],[4, 5, 6], [7, 8, 9]]
print(A)
type(A)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

list

In [6]:
# DataFrame method for convert a list to dta frame format
B = pd.DataFrame(A)
B

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
# you can give some column and axis titles to the dataFrame
B = pd.DataFrame(A, columns = ['col1', 'col2', 'col3'], index = ['Ex1', 'Ex2', 'Ex3'])
B

     col1  col2  col3
Ex1     1     2     3
Ex2     4     5     6
Ex3     7     8     9

In [11]:
# how sliding the DataFrame? Using iloc method
B.iloc[:,0:2] # all rows, but only 1th and 2th columns

     col1  col2
Ex1     1     2
Ex2     4     5
Ex3     7     8

In [12]:
B.iloc[0:2, :]

     col1  col2  col3
Ex1     1     2     3
Ex2     4     5     6

In [15]:
# take a variable suing name of row and column
B.loc['Ex2', 'col3']

6

In [16]:
# replace value 9 to 100
B.replace(9, 100)

     col1  col2  col3
Ex1     1     2     3
Ex2     4     5     6
Ex3     7     8   100

In [17]:
# what if you want multiple values
B.replace({5:20, 7:30})

     col1  col2  col3
Ex1     1     2     3
Ex2     4    20     6
Ex3    30     8     9

In [18]:
# how you drop a row or colum
# axis = 0 search in rows to drop
# axis = 1 search in column to drop
B.drop('col1', axis = 1)

     col2  col3
Ex1     2     3
Ex2     5     6
Ex3     8     9

In [25]:
B.sort_index()

     col1  col2  col3
Ex1     1     2     3
Ex2     4     5     6
Ex3     7     8     9